# Compound Structure Layer Constructor

Source: https://www.revitapidocs.com/2026/d891bb72-066f-caeb-4322-81e30ae45a24.htm

---

| Compound Structure Layer Constructor |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CompoundStructureLayer | Creates a compound structure layer using default settings. |
|  | CompoundStructureLayer(CompoundStructureLayer) | Creates a copy of a compound structure layer. |
|  | CompoundStructureLayer(Double, MaterialFunctionAssignment, ElementId) | Creates a default compound structure layer based on the given width, function and material element id. The priority is initialized with 999\. |

Top See Also

#### Reference

CompoundStructureLayer Class Autodesk.Revit.DB Namespace